driver-tests/jmsbc/JMSBCTests/JMSBCjavaeeSETestJbi/test/JMSBCjavaeeSETest_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <OutputElement xmlns="http://xml.netbeans.org/schema/OutToJMSBC">
      <ns2:msg xmlns:ns2="http://xml.netbeans.org/schema/OutToJMSBC">JavaEE SE got message: Helloooooo JavaEE SE!!</ns2:msg>
      <ns2:id xmlns:ns2="http://xml.netbeans.org/schema/OutToJMSBC">12345</ns2:id>
    </OutputElement>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
